tests/load/api-load-test.yml
# Artillery Load Testing Configuration
# CNN Chile Infrastructure - API Load Testing

config:
  target: 'https://api-dev.cnnchile.com'
  phases:
    # Warm up
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained load
    - duration: 300
      arrivalRate: 50
      name: "Sustained load"
    
    # Peak load
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Peak load"
    
    # Cool down
    - duration: 60
      arrivalRate: 100
      rampTo: 5
      name: "Cool down"

  payload:
    path: "./test-data.csv"
    fields:
      - "email"
      - "password"

  variables:
    api_version: "v1"

  defaults:
    headers:
      Content-Type: 'application/json'
      User-Agent: 'Artillery Load Test'
      Accept: 'application/json'

  # Plugins para métricas extendidas
  plugins:
    expect: {}
    metrics-by-endpoint:
      useOnlyRequestNames: true

scenarios:
  # Test de autenticación
  - name: "Authentication Flow"
    weight: 30
    flow:
      - post:
          url: "/api/{{ api_version }}/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "auth_token"
            - json: "$.user.id"
              as: "user_id"
          expect:
            - statusCode: 200
            - hasProperty: "token"

      - get:
          url: "/api/{{ api_version }}/auth/profile"
          headers:
            Authorization: "Bearer {{ auth_token }}"
          expect:
            - statusCode: 200

  # Test de contenido público
  - name: "Public Content"
    weight: 40
    flow:
      - get:
          url: "/api/{{ api_version }}/news"
          qs:
            limit: 20
            category: "general"
          expect:
            - statusCode: 200
            - contentType: json

      - get:
          url: "/api/{{ api_version }}/news/trending"
          expect:
            - statusCode: 200

      - get:
          url: "/api/{{ api_version }}/categories"
          expect:
            - statusCode: 200

  # Test de búsqueda
  - name: "Search Functionality"
    weight: 20
    flow:
      - get:
          url: "/api/{{ api_version }}/search"
          qs:
            q: "política"
            limit: 10
          expect:
            - statusCode: 200

      - get:
          url: "/api/{{ api_version }}/search"
          qs:
            q: "economía"
            category: "business"
          expect:
            - statusCode: 200

  # Test de contenido premium (requiere auth)
  - name: "Premium Content"
    weight: 10
    flow:
      # Login first
      - post:
          url: "/api/{{ api_version }}/auth/login"
          json:
            email: "premium@example.com"
            password: "Premium123!"
          capture:
            - json: "$.token"
              as: "premium_token"
          expect:
            - statusCode: 200

      # Access premium content
      - get:
          url: "/api/{{ api_version }}/content/premium"
          headers:
            Authorization: "Bearer {{ premium_token }}"
          expect:
            - statusCode: 200

      # Access live streams
      - get:
          url: "/api/{{ api_version }}/streaming/live"
          headers:
            Authorization: "Bearer {{ premium_token }}"
          expect:
            - statusCode: 200